const poems = [
  {
    title: "انفراد",
    text: "تنهایی رفیق دیرین من است
یار با وفا و شیرین من است
انسان رحم بر کس ندارد که
انزوا و انفراد دین من است"
  },
  {
    title: "وصال",
    text: "در قلبم آتشدان عشق بپاست
در سرم تنها فقط یک صداست
چشم هایم خیره ، کِی می‌رسی ؟
سینه ام از فرطِ احساس شکافت

تو را هر شب ُ روز خواستمت
تو را در اوج نومیدی یافتمت
تو از کدام جغرافیا آمده ای؟
تمامِ من شدی از بدوِ شناختنت

تپش قلب گرفته ام از دوریَت
مبهوتم از پاکی و معصومی ات
زندگی با تو معنا پیدا می‌کند
من فدایِ مهربانی و مظلومی ات

ذکر ِ لبم هر شب و روز نام توست
سخن میگویی ُ گل از غنچه شکفت
جانم شدی لیلیِ در زمستان نشانی
منفردم نام که میشوم با تو جفت"
  },
  {
    title: "آتشفشانِ غم",
    text: "به تنگ آمده قلبم از درد
 در آغوشم آتشفشانِ غم
 
دشنه ی دنیا دلم را خون
 کرده دلگیر از عالم و آدم 

تبعید شده ام به زمینِ کفر
آواره ام پوچ منزوی و گُم

طوفان زده بر قلعه ی فکر
سر پُر ز خیال ِ عدمِ مردُم

قصه ای تلخ و دراماتیکم
بند بندم رو به بی میلی

فرهادم که تیشه بر بیستون
زدمُ مجنون که غرقِ  در لیلی


خسته از عاشقانه های رمانُ
عادتم دوستی با فاجعه

مصرعِ بعدی شرحِ  حال من
تا ابد من واهمه من واهمه "
  }
];

const container = document.getElementById("poems-container");

if (container) {
  poems.forEach(poem => {
    const div = document.createElement("div");
    div.className = "poem";
    div.innerHTML = 
      <h3>${poem.title}</h3>
      <p>${poem.text}</p>
    ;
    container.appendChild(div);
  });
}
